{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "conv1_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "conv1_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [128], "dtype": "float32"}, {"name": "conv2_1x1/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_1/kernel", "shape": [3, 3, 128, 192], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [192], "dtype": "float32"}, {"name": "conv3_1x1/kernel", "shape": [1, 1, 128, 192], "dtype": "float32"}, {"name": "conv3_2/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [192], "dtype": "float32"}, {"name": "conv4_1/kernel", "shape": [3, 3, 192, 256], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_1x1/kernel", "shape": [1, 1, 192, 256], "dtype": "float32"}, {"name": "conv4_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [1, 1, 640, 256], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [512, 722], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [722], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_2/forward_lstm_2/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional_2/backward_lstm_2/bias", "shape": [128], "dtype": "float32"}, {"name": "time_distributed_2/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "time_distributed_2/bias", "shape": [2], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32"}]}]}